import { makeObservable, computed, observable, action } from 'mobx';

class Store{
    @observable gallery = [
        {
            id: 0,
            description: "Нацгвардійці підписали меморандум про співпрацю с закладами культури Донеччини\n",
            imageUrl: "https://sp-ao.shortpixel.ai/client/to_webp,q_glossy,ret_img,w_900/https://ngu.gov.ua/wp-content/uploads/2021/11/1-12.jpg"
        },
        {
            id: 1,
            description: "Представники академії НГУ стали першими слухачами концертної програми класичної музики для гвардійців",
            imageUrl: "https://sp-ao.shortpixel.ai/client/to_webp,q_glossy,ret_img,w_2048/https://ngu.gov.ua/wp-content/uploads/2021/10/konczert-nangu-16-2048x1365.jpg"
        },
        {
            id: 2,
            description: "В музеї Дніпра відкрили фотовиставку нацгвардійця учасника АТО/ООС",
            imageUrl: "https://sp-ao.shortpixel.ai/client/to_webp,q_glossy,ret_img,w_900/https://ngu.gov.ua/wp-content/uploads/2021/10/pid-nebom-8.jpg"
        },
        {
            id: 3,
            description: "Президент Володимир Зеленський вручив державні нагороди військовослужбовцям Національної гвардії України",
            imageUrl: "https://sp-ao.shortpixel.ai/client/to_webp,q_glossy,ret_img,w_900/https://ngu.gov.ua/wp-content/uploads/2021/10/18-3.jpg"
        },
        {
            id: 4,
            description: "Нацгвардія відзначає День захисників та захисниць України",
            imageUrl: "https://sp-ao.shortpixel.ai/client/to_webp,q_glossy,ret_img,w_900/https://ngu.gov.ua/wp-content/uploads/2021/10/czentralne-13.jpg"
        },
        {
            id: 5,
            description: "14 жовтня – свято Покрови Пресвятої Богородиці",
            imageUrl: "https://sp-ao.shortpixel.ai/client/to_webp,q_glossy,ret_img,w_900/https://ngu.gov.ua/wp-content/uploads/2021/10/1-20.jpg"
        },
        {
            id: 6,
            description: "Нацгвардійці проводили уроки у Львові – для школярів, а у Тернополі – для ліцеїстів",
            imageUrl: "https://sp-ao.shortpixel.ai/client/to_webp,q_glossy,ret_img,w_900/https://ngu.gov.ua/wp-content/uploads/2021/10/img_2491.jpg"
        },
        {
            id: 7,
            description: "Військовослужбовці Нацгвардії привітали освітян України з професійним святом",
            imageUrl: "https://sp-ao.shortpixel.ai/client/to_webp,q_glossy,ret_img,w_900/https://ngu.gov.ua/wp-content/uploads/2021/10/dsc_3981.jpg"
        },
        {
            id: 8,
            description: "«АТО/ООС очима сучасних художників». Одними з перших виставку побачили гвардійці",
            imageUrl: "https://sp-ao.shortpixel.ai/client/to_webp,q_glossy,ret_img,w_820/https://ngu.gov.ua/wp-content/uploads/2021/10/ang_9468.jpg"
        },
        {
            id: 9,
            description: "Небайдужий громадянин привіз харківським гвардійцям понад півтисячі книжок!",
            imageUrl: "https://sp-ao.shortpixel.ai/client/to_webp,q_glossy,ret_img,w_900/https://ngu.gov.ua/wp-content/uploads/2021/09/3017_knygy_41.jpg"
        }
        ];
    @observable news = [
        {
            id: 0,
            title: "В Україні на запит Нацгвардії розробили бронежилет для жінок",
            description: "В Україні розробили бронежилети для жінок-військовослужбовиць, повідомила заступниця міністра внутрішніх справ Мері Акопян. За її словами, інтеграція жінок в армію та Нацгвардію активно відбувається останні кілька років, і щоб забезпечити їм комфорт та захист під час несення служби, для них розробили бронежилет.\n" +
                "https://zaxid.net/news/"
        },
        {
            id: 1,
            title: "18-річний солдат-строковик випав з вікна казарми у Львові",
            description: "У Львові на території військової частини Національної гвардії 4114 з вікна казарми випав 18-річний солдат строкової служби. Інцидент трапився 30 жовтня, але про нього стало відомо лише зараз. Усі обставини трагедії з’ясовують правоохоронці.\n" +
                "\n" +
                "Трагічний інцидент стався вдень на території військової частини Нацгвардії на вул. Стрийській у Львові.\n" +
                "\n" +
                "У поліції Львівщини розповіли ZAXID.NET, що 18-річний строковик з міста Первомайський, що на Харківщині, випав з вікна четвертого поверху. Незважаючи на реанімаційні заходи медиків, він помер. За фактом трагедії поліцейські відкрили кримінальне провадження за ч. 1 ст. 115 (умисне вбивство) ККУ з приміткою «самогубство»."
        },
        {
            id: 2,
            title: "Командира частини Нацгвардії судитимуть за збитки в 1 млн грн на закупівлі респіраторів",
            description: "Командира однієї з військових частин Національної гвардії України судитимуть за збитки в понад 1 млн грн при закупівлі респіраторів.\n" +
                "\n" +
                "Про це повідомили в Офісі генерального прокурора.\n" +
                "\n" +
                "Так, прокурори Спеціалізованої прокуратури у військовій та оборонній сфері скерували до суду обвинувальний акт стосовно командира однієї з військових частин Національної гвардії України за фактом «недбалого ставлення до служби, вчиненого в умовах особливого періоду» (ч. 3 ст. 425 Кримінального кодексу України). Стаття передбачає покарання у вигляді позбавлення волі на строк від п’яти до семи років.\n" +
                "\n" +
                "За версією слідства, командир військової частини під час організації проведення закупівлі респіраторів з метою запобігання поширенню COVID-19 визначив ціну на них з урахуванням податку на додану вартість. Це спричинило понад 1 млн грн збитків державі.\n" +
                "\n" +
                "\n" +
                "https://zaxid.net/news/"
        },
        {
            id: 3,
            title: "Військові частини Нацгвардії отримали власні нарукавні знаки",
            description: "Військові частини Національної гвардії України отримали власні нарукавні знаки, повідомила в середу, 25 серпня, прес-служба Міністерства внутрішніх справ.\n" +
                "\n" +
                "Нові шеврони для повсякденної і польової форми одягу виконані в двох кольорах – синьому і оливковому. У їх центрі розташоване коло темно-зеленого кольору, в якому виконана символіка відповідної області, де розташована військова частина. Наприклад, герб.\n" +
                "\n" +
                "Як пояснили у Національній гвардії, дозвіл використовувати символіку областей надали обласні ради.\n" +
                "\n" +
                "На відео, яке опублікувала прес-служба МВС, військовослужбовці розповіли про те, що на нарукавних знаках також зображено герби тих міст, у яких вони служать, наприклад, Маріуполя чи Дніпра."
        },
        {
            id: 4,
            title: "Нацгвардієць викрав автомобіль, щоб поїхати зі Львова у Тернопіль",
            description: "Старший солдат військової частини Нацгвардії, яка розташована у Львові, викрав автомобіль у селі Сокільники, щоб поїхати додому. Поліція оперативно затримала нацгвардійця на викраденому авто дорогою до Тернополя.\n" +
                "\n" +
                "Про цей інцидент вранці 11 серпня повідомив сайт 368.media. Проте в ухвалі суду вказано, що сам випадок трапився наприкінці липня.\n" +
                "\n" +
                "29 липня старший солдат, що служить за контрактом у військовій частині 4114 Нацгвардії, що на вул. Стрийській у Львові, побачив припарковане авто Ford Sierra на вул. Шевченка у Сокільниках. Власник авто залишив ключ у замку запалювання. Нацгвардієць хотів поїхати до себе додому на Тернопільщину та вирішив зробити це, викравши чуже авто.\n" +
                "\n" +
                "Поліція затримала нацгвардійця на викраденому авто на трасі Тернопіль – Львів – Рава-Руська. Наступного дня йому оголосили підозру у викраденні автомобіля, а суд обрав запобіжний захід – чоловіка відпустили під особисте зобов’язання.\n" +
                "\n"
        },
        {
            id: 5,
            title: "НАБУ скерувало до суду справу щодо купівлі непридатних квартир для Нацгвардії",
            description: "До Вищого антикорупційного суду скерували обвинувачення стосовно п’ятьох осіб, які організували закупівлю непридатних для проживання квартир для військовослужбовців Національної гвардії.\n" +
                "\n" +
                "Як повідомили у прес-службі Національного антикорупційного бюро, серед обвинувачених: начальник управління розквартирування і капітального будівництва логістики ГУ Нацгвардії, директор ТОВ-переможця конкурсу, адвокат, представник директора ТОВ, бенефіціар ТОВ, начальник фінансового відділу управління розквартирування і капітального будівництва логістики ГУ Нацгвардії.\n" +
                "\n" +
                "За даними слідства, державним бюджетом України на 2017 рік передбачалося понад 85,94 млн грн на придбання житла для військовослужбовців НГУ.\n" +
                "\n" +
                "«Дізнавшись про це, у бенефіціарного власника низки юридичних осіб виник злочинний задум із заволодіння коштами Нацгвардії. До його реалізації він залучив службових осіб НГУ, членів конкурсної комісії з придбання житла для військовослужбовців, та підконтрольні йому комерційні компанії», — йдеться в повідомленні.\n" +
                "\n" +
                "Учасники групи забезпечили участь підконтрольного ТОВ у конкурсі з придбання житла, створивши хибне уявлення членів конкурсної комісії, не залучених до вчинення злочину, про відповідність заявлених квартир умовам конкурсу.\n" +
                "\n" +
                "\n" +
                "https://zaxid.net/news/"
        },
        {
            id: 6,
            title: "20-річний нацгвардієць-строковик кинувся під потяг і загинув на Херсонщині",
            description: "У Херсонській області загинув боєць Національної гвардії України. У понеділок, 28 червня, він кинувся під пасажирський потяг Одеса – Харків біля села Киселівка, повідомив у вівторок, 29 червня, «Новий день».\n" +
                "\n" +
                "Чоловік отримав травми, несумісні з життям. Медики, які прибули на місце події, не змогли його врятувати.\n" +
                "\n" +
                "У частині, де служив нацгвардієць-строковик, повідомили, що конфліктів із співслужбовцями у нього не було, офіцери до нього претензій також не мали. У день своєї загибелі юнак покинув частину без дозволу і поїхав до Білозерського району, з якого він родом, де і скоїв самогубство.\n" +
                "\n" +
                "У частині припустили, що, можливо, причиною суїциду могли бути якісь домашні проблеми чи сварка з дівчиною. Однак остаточні причини має встановити слідство.\n" +
                "\n" +
                "Ім’я загиблого нацгвардійця не повідомляється.\n" +
                "\n" +
                "\n" +
                "https://zaxid.net/news/"
        },
        {
            id: 7,
            title: "Нацгвардієць Віталій Марків повернувся на службу",
            description: "Військовослужбовець Національної гвардії Віталій Марків вже повернувся на службу до лав структури. Про це повідомив директор департаменту комунікації Міністерства внутрішніх справ Артем Шевченко.\n" +
                "\n" +
                "«Нині він (Марків — ред.) повернувся на службу до Національної гвардії України і зі своїм захистом готується до касаційного розгляду своєї справи вже у Римі. Боротьба триває», — написав Шевченко.\n" +
                "\n" +
                "Він окремо нагадав, що рівно 7 років тому, 24 травня 2014 року, у так званий день тиші перед днем голосування на дочасних виборах президента України під час бойових дій у Слов'янську, захопленому російськими терористами ексофіцера ФСБ Ігоря Гіркіна (Стрелкова), внаслідок ураження уламками мін 120 мм загинули громадянин Італії фоторепортер Андреа Роккеллі та його перекладач громадянин РФ Андрій Миронов.\n" +
                "\n" +
                "Шевченко уточнив, що італієць Роккеллі і росіянин Миронов стали першими іноземними журналістами, які загинули внаслідок бойових дій на Донбасі.\n" +
                "\n"
        },
        {
            id: 8,
            title: "Нацгвардійці на Донбасі записали відео з нагоди Дня матері",
            description: "До Дня матері, який у 2021 році припадає на 9 травня, нацгвардійці, які виконують завдання в районі Операції об’єднаних сил на Донбасі, записали відеоролик з привітаннями для українських матерів. Про це повідомила прес-служба Нацгвардії.\n" +
                "\n" +
                "У відео бійці висловили подяку і передали вітання матерям – своїм власним та усім матусям України. За словами учасників відео, головне – заспокоїти мам, які хвилюються завжди – скільки б років не було сину і скільки б ротацій вони вже не відбували на Схід\n" +
                "\n" +
                "\n" +
                "https://zaxid.net/news/"
        },
        {
            id: 9,
            title: "В Україні почали вакцинацію поліцейських, рятувальників і прикордонників",
            description: "У суботу, 17 квітня, почалася вакцинація від коронавірусу працівників системи органів Міністерства внутрішніх справ. Загалом планують вакцинувати близько 800 тис. працівників системи МВС і членів їхніх сімей, повідомив міністр внутрішніх справ України Арсен Аваков.\n" +
                "\n" +
                "«Сьогодні ми почали вакцинацію співробітників системи органів МВС від Covid-19. Першими вакцинуємо працівників, які найбільше контактують з населенням: гарнізони аеропортів “Бориспіль” та “Жуляни”, підрозділи Нацгвардії в зоні ООС, працівники громадської безпеки, підрозділи патрульної поліції. Далі вакцинуємо всіх співробітників системи МВС: Нацполіцію, ДСНС, Нацгвардію, прикордонну службу, сервісні центри, вищі навчальні заклади, експертну службу, співробітників МВС», – процитувала Авакова в суботу, 17 квітня, прес-служба МВС.\n" +
                "\n" +
                "йдеться в заяві Авакова, опублікованій на сайті МВС.\n" +
                "\n" +
                "Він зазначив, що наступним етапом медики МВС вакцинуватимуть сім'ї співробітників відомства. Загалом із сім'ями планується охопити близько 800 тис. осіб.\n" +
                "\n"
        },
        {
            id: 10,
            title: "Майор з Дніпра вимагав у солдата гроші на азартні ігри",
            description: "Красногвардійський районний суд Дніпра оштрафував начальника штабу військової частини 3054 за зловживання впливом, повідомив «Судовий репортер» з посиланням на вирок від 5 квітня.\n" +
                "\n" +
                "Згідно з судовими матеріалами, 13 жовтня 2020 року приблизно о 15 годині майор зайшов до кімнати канцелярії стрілецької роти. Побачивши солдатів майор звелів одному з них дати для огляду власний мобільний телефон. Майор почав читати особисті листування у месенджерах солдата. В одному з них майор нібито побачив спілкування солдатів щодо придбання наркотиків для подальшого вживання.\n" +
                "\n" +
                "Після цього майор запросив солдата до себе в кабінет і пригрозив донести цю інформацію до командира військової частини 3054 Національної гвардії України. Але водночас пообіцяв закрити на все очі, якщо солдат поповнить на 10 тисяч гривень його рахунок у букмекерській конторі «Паріматч».\n" +
                "\n" +
                "\n" +
                "https://zaxid.net/news/"
        },
        {
            id: 11,
            title: "В Україні продовжують активно скорочувати кількість призовників",
            description: "Кабінет міністрів України на своєму засіданні в середу, 24 березня, затвердив чисельність громадян України, що підлягають призову на строкову військову службу у квітні-червні 2021 року, у кількості 14 тис. 246 осіб.\n" +
                "\n" +
                "Згідно з ухваленим рішенням, із загальної кількості призовників 6,5 тис. осіб буде відправлено до Збройних сил України, 4,6 тис. до Національної гвардії, 2,5 тис. – до Державної прикордонної служби і ще 600 – до Державної спеціальної служби транспорту.\n" +
                "\n" +
                "На здійснення призову Кабмін виділив 66 млн грн, з яких 30,11 млн грн – на здійснення призову до ЗСУ, 21,52 млн грн – до Нацгвардії, 11,58 млн грн – до Держприкордонслужби і 2,77 млн грн – до Держспецтрансслужби.\n" +
                "\n" +
                "\n" +
                "https://zaxid.net/news/"
        },
        {
            id: 12,
            title: "Цьогоріч Нацгвардія отримає шість французьких вертольотів від Airbus",
            description: "Національна гвардія України протягом 2021 та 2022 років отримає 10 французьких вертольотів H225 в межах реалізації контракту з Airbus Helicopters, повідомила в суботу, 6 лютого, прес-служба Міністерства внутрішніх справ.\n" +
                "\n" +
                "Як нагадали в МВС, компанія Airbus Helicopters та ДП «Українське авіаційно-транспортне підприємство «Хорів-АВІА» підписали контракт про постачання впродовж 2018-2022 років 12 вертольотів типу H225 для потреб Нацгвардії. Два з них Нацгвардія отримала в 2018 та 2019 роках.\n" +
                "\n" +
                "«На офіційній зустрічі представники Нацгвардії та Airbus Helicopters розглянули питання поставки шести повітряних суден у 2021 році та відправки двох наявних в НГУ вертольотів на підприємства компанії Airbus Helicopters. Таке рішення було прийнято, щоб провести модернізацію з метою доукомплектування гелікоптерів, переданих попередньо», – зазначається в повідомленні.\n" +
                "\n" +
                "\n" +
                "https://zaxid.net/news/"
        },
        {
            id: 13,
            title: "Зеленський нагородив нацгвардійця Віталія Марківа орденом «За мужність» III ступеня",
            description: "Президент України Володимир Зеленський, беручи до уваги клопотання Міністерства внутрішніх справ України, підписав указ про нагородження старшого сержанта Національної гвардії Віталія Марківа орденом «За мужність» III ступеня, повідомила в суботу, 12 грудня, прес-служба Офісу президента.\n" +
                "\n" +
                "«Сьогодні, у День Сухопутних військ, коли Україна вшановує своїх героїв, які стоять на захисті свободи і незалежності нашої держави, та дякує їм за гідну службу, Віталій Марків нагороджений за видатні особисті досягнення у державній та суспільній діяльності, зразкове виконання службового та громадянського обов'язку, високу професійність і вагомий внесок у захист прав і свобод громадян та інтересів України на міжнародному рівні», – сказано в повідомленні.\n" +
                "\n" +
                "\n" +
                "https://zaxid.net/news/"
        },
        {
            id: 14,
            title: "НАБУ звинуватило Венедіктову у перешкоджанні врученню підозри Татарову",
            description: "НАБУ звинуватило генпрокурорку Ірину Венедіктову у перешкоджанні притягненню до відповідальності заступника керівника Офісу президента Олега Татарова, який фігурує у провадженні про розкрадання майна Нацгвардії, а саме у причетності до фальсифікації експертизи у справі екс-нардепа та забудовника Максима Микитася. Про це НАБУ повідомила у середу, 2 грудня.\n" +
                "\n" +
                "Вони стверджують, що Венедіктова без будь-яких правових підстав змінила процесуальних керівників у кримінальному провадженні про фальсифікацію експертизи, через що детективи НАБУ та прокурори САП не змогли у передбачені законом терміни повідомити про підозру третьому ймовірному учаснику злочину – колишньому топ-посадовцю державної компанії «Укрбуд» Олегу Татарову.\n" +
                "\n" +
                "\n" +
                "https://zaxid.net/news/"
        },
        {
            id: 15,
            title: "Суд заарештував чиновника МВС у справі про розкрадання майна Нацгвардії",
            description: "Вищий антикорупційний суд взяв під варту заступника директора Державного науково-дослідного експертно-криміналістичного центру МВС, який фігурує у справі про розкрадання майна Нацгвардії, із альтернативою внесення 1 млн грн застави. Про це 2 грудня повідомила прес-служба САП.\n" +
                "\n" +
                "Як уточнює громадська органазація «Центр протидії корупції», йдеться про Костянтина Дубоноса, який отримав від екс-нардепа Максима Микитася хабар у вигляді паркомісця за 250 тисяч грн. Натомість посадовець на папері зменшив суму збитків від справи з 81 млн до 7 млн грн. Зазначимо, що напередодні, 1 грудня, НАБУ повідомила їм про підозри.\n" +
                "\n" +
                "\n" +
                "https://zaxid.net/news/"
        },
        {
            id: 16,
            title: "Підозрюваному у розкраданні майна НГУ екс-нардепу оголосили нову підозру",
            description: "НАБУ (Національне антикорупційне бюро України) повідомило про нові підозри двом фігурантам справи про розкрадання майна Нацгвардії на суму понад 81 млн грн. Про це у вівторок, 1 грудня, повідомила прес-служба антикорупційного відомства.\n" +
                "\n" +
                "Екс-нардеп Максим Микитась, який також є колишнім власником ТОВ «Укрбуд Девелопмент», підозрюється у наданні хабаря за недостовірний письмовий висновок судового експерта. Йому оголосили підозру за статтею про пропозицію, обіцянку або надання неправомірної вигоди службовій особі. Санкція третьої частини цієї статті передбачає позбавлення волі на строк від чотирьох до восьми років з конфіскацією майна або без такої.\n" +
                "\n" +
                "\n" +
                "https://zaxid.net/news/"
        },
        {
            id: 17,
            title: "Командир підрозділу Нацгвардії продавав інформацію спецслужбам РФ",
            description: "Служба безпеки України викрила командира одного з підрозділів Національної гвардії, який продавав секретні дані спецслужбам Росії. Про це повідомили у прес-службі відомства у середу, 21 листопада.\n" +
                "\n" +
                "Як розповіли у спецслужбі, військовослужбовець відсилав агресору дані про міжнародну військову допомогу, яку отримували підрозділи Нацгвардії, діяльність іноземних інструкторів, а також схеми розташування українських режимних об’єктів».\n" +
                "\n" +
                "\n" +
                "https://zaxid.net/news/"
        },
        {
            id: 18,
            title: "У Львові з військової частини Нацгвардії зник контрактник",
            description: "У вівторок, 24 листопада, Франківський відділок поліції оголосив в розшук 20-річного солдата-конрактника, Сергія Грищенка, який зник з військової частини у Львові. У поліції повідомили, що солдат вийшов з військової частини №3002 Національної гвардії майже тиждень тому і до тепер не повернувся.\n" +
                "\n" +
                "Зниклому Сергієві Грищенку 20 років, вже півтора року він служить за контрактом у військовій частині на вул. Княгині Ольги. У середу, 18 листопада, близько 17:00 він вийшов з частини, а наступного дня не з'явився на службу. На дзвінки не відповідав, вдома солдат не з'являвся.\n" +
                "\n" +
                "\n" +
                "https://zaxid.net/news/"
        },
        {
            id: 19,
            title: "Звільнений з італійської в'язниці Віталій Марків поновився на службі у Нацгвардії\n",
            description: "Віталій Марків, який майже 3,5 роки перебував у італійській в'язниці та був звільнений 3 листопада за апеляцією, поновився на службі у Національній гвардії України. Про це він розповів в інтерв'ю виданню LB.ua.\n" +
                "\n" +
                "«Службу я вже поновив. Офіційно перебуваю зараз у відпустці. Маю 26 днів, щоб пройти медичний огляд, реабілітацію. Потім плануємо з дружиною на кілька днів поїхати у відпустку десь на території України. Після буде служба в Національній гвардії України. Я повернуся до свого батальйону (ім. Кульчицького – ред.), – розповів Марків.\n" +
                "\n" +
                "\n" +
                "https://zaxid.net/news/"
        },
        {
            id: 20,
            title: "Докази невинуватості Віталія Марківа для апеляційного суду знайшли журналісти\n",
            description: "Українська журналістка Ольга Токарюк, співавторка фільму «Між двох вогнів» про нацгвардійця Віталія Марківа, розповіла про журналістське розслідування, яке знайшло докази його невинуватості. В ефірі програми Свобода слова Савіка Шустера журналістка пояснила, що метою розслідувачів було встановити, що насправді сталося 24 травня 2014 року в Слов'янську і за яких обставин загинули Андреа Роккеллі і Андрій Миронов, у смерті яких звинувачували Марківа.\n" +
                "\n" +
                "«Нашим головним питанням було - як так, що Віталія Марківа засудили до 24 років і ані італійські, ані українські слідчі не провели серйозне розслідування на місці події? Ми вирішили зробити це як журналісти – поїхати до Слов'янська, подивитися видимість з гори Карачун, перевірити дальність стрільби, – чи можна було взагалі потрапити в журналістів зі зброї, яку мав Віталій Марків, – знайти свідків, яких не допитали в суді», – сказала Токарюк, яку процитувало «Новое время»\n" +
                "\n" +
                "\n" +
                "https://zaxid.net/news/"
        },
        {
            id: 21,
            title: "Італійський суд повністю виправдав Віталія Марківа",
            description: "Італійський апеляційний суд у вівторок, 3 листопада виправдав і звільнив з-під варти українського нацгвардійця Віталія Марківа, повідомила журналістка Наталія Кудрик, яка брала участь у засіданні.\n" +
                "\n" +
                "Справу розглядав апеляційний суд у Мілані після того, як суд першої інстанції у місті Павія засудив українця до 24 років в'язниці за нібито причетність до смерті італійського журналіста біля Слов'янська під час боїв.\n" +
                "\n"
        },
    ];
    @computed get getAllImages(){
        return this.gallery;
    }

    @computed get getAllNews(){
        return this.news;
    }

    constructor(){
        makeObservable(this);
    }
}

export default Store;