import React from "react";
import {Container} from 'react-bootstrap';

function AboutPage (){
    return(
        <Container>
            <h1>Про сайт</h1>
            <div><strong>Націона́льна гва́рдія Украї́ни</strong> — військове формування з правоохоронними функціями, що входить до системи Міністерства внутрішніх справ України (МВС) і призначено для виконання завдань із захисту та охорони життя, прав, свобод і законних інтересів громадян України, суспільства і держави від злочинних та інших протиправних посягань, охорони громадського порядку та забезпечення громадської безпеки, а також у взаємодії з правоохоронними органами — із забезпечення державної безпеки і захисту державного кордону, припинення терористичної діяльності, діяльності незаконних воєнізованих або збройних формувань (груп), терористичних організацій, організованих груп та злочинних організацій. Як самостійна силова структура існувала з 1991 по 2000, як військове формування з правоохоронними функціями на базі Внутрішніх військ Міністерства внутрішніх справ України та залученням нових військових кадрів на добровольчій основі з 13 березня 2014 року[5]. Загальна чисельність — до 60 тисяч військовослужбовців.</div>
            <div>Національна гвардія функціонує в системі Міністерства внутрішніх справ України. Міністр внутрішніх справ України здійснює військово-політичне та адміністративне керівництво Національною гвардією України. До особового складу Національної гвардії України входять військовослужбовці та працівники. Військовослужбовці проходять військову службу за контрактом та за призовом. Військовослужбовці Національної гвардії України на період військової служби зупиняють членство в політичних партіях та професійних спілках. Існує Військовий резерв Національної гвардії України. Резервісти, які проходять службу у Резерві Нацгвардії, одержують відповідні військові знання.</div>
        </Container>
    )
}
export default AboutPage;